KT Updates (#183)
* KT docs WIP

* Updates to KT

* Updates to KT

---------

Co-authored-by: Kevin Antony <kevinantony@users.noreply.github.com>
